Cannot assign or add [Element] to Circuit. There is no assigned distribution system for [Element].
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId MismatchNmbAssignedDistSysToCircuit { get; }
  Visual Basic
Public Shared ReadOnly Property MismatchNmbAssignedDistSysToCircuit As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ MismatchNmbAssignedDistSysToCircuit {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures ElectricalFailures Class
  Autodesk.Revit.DB Namespace